#pragma once
#include <stdio.h>
#include <stdlib.h>

typedef struct qanda
{
	char Q;
	char A;
	int is_once = 1;
} QANDA;

QANDA hiragana_arr[47] = {
	{"あ", "아"}, // あ행
	{"い", "이"},
	{"う", "우"},
	{"え", "에"},
	{"お", "오"},
	
	{"か", "카"}, // か행
	{"き", "키"},
	{"く", "쿠"},
	{"け", "케"},
	{"こ", "코"},
	
	{"さ", "사"}, // さ행
	{"し", "시"},
	{"す", "스"},
	{"せ", "세"},
	{"そ", "소"},
	
	{"た", "타"}, // た행
	{"ち", "치"},
	{"つ", "츠"},
	{"て", "테"},
	{"と", "토"},
	
	{"な", "나"}, // な행
	{"に", "니"},
	{"ぬ", "누"},
	{"ね", "네"},
	{"の", "노"},
	
	{"は", "하"}, // は행
	{"ひ", "히"},
	{"ふ", "후"},
	{"へ", "헤"},
	{"ほ", "호"},
	
	{"ま", "마"}, // ま행
	{"み", "미"},
	{"む", "무"},
	{"め", "메"},
	{"も", "모"},
	
	{"や", "야"}, // や행
	{"ゆ", "유"},
	{"よ", "요"},
	
	{"ら", "라"}, // ら행
	{"り", "리"},
	{"る", "루"},
	{"れ", "레"},
	{"ろ", "로"},
	
	{"わ", "와"}, // わ행
	{"を", "오"},
	{"ん", "응"}	
}

void hiragana_test();
void gatakana_test();
void word_test();
void grammer_test();